package program.strategy;

/*Укорочувач Shortener підтримуватиме різні стратегії зберігання даних
(рядків та їх ідентифікаторів). Всі ці стратегії успадковуватимуться від інтерфейсу StorageStrategy.
 Наше сховище оперуватиме двома поняттями: ключ і значення. Ключем буде ідентифікатор рядка,
 а значенням сам рядок.
 */

public interface StorageStrategy {


    //метод повинен повернути true, якщо сховище містить переданий ключ
    boolean containsKey(Long key);


    // метод повинен повернути true, якщо сховище містить передане значення.
    boolean containsValue(String value);


    //метод додає до сховища нову пару ключ - значення.
    void put(Long key, String value);


    //метод повертає ключ для переданого значення
    Long getKey(String value);


    //метод повертає значення для переданого ключа.
    String getValue(Long key);
}

